PX4/NuttX/arch/arm/src/stm32/hardware/stm32f412xx_rcc.h
/* Spread spectrum clock generation register */

#define RCC_SSCGR_MODPER_SHIFT      (0)       /* Bit 0-12: Modulation period */
#define RCC_SSCGR_MODPER_MASK       (0x1fff << RCC_SSCGR_MODPER_SHIFT)
#  define RCC_SSCGR_MODPER(n)       ((n) << RCC_SSCGR_MODPER_SHIFT)
#define RCC_SSCGR_INCSTEP_SHIFT     (13)      /* Bit 13-27: Incrementation step */
#define RCC_SSCGR_INCSTEP_MASK      (0x7fff << RCC_SSCGR_INCSTEP_SHIFT)
#  define RCC_SSCGR_INCSTEP(n)      ((n) << RCC_SSCGR_INCSTEP_SHIFT)
#define RCC_SSCGR_SPREADSEL         (1 << 30) /* Bit 30: Spread Select */
#define RCC_SSCGR_SSCGEN            (1 << 31) /* Bit 31: Spread spectrum modulation enable */

/* PLLI2S configuration register */

#define RCC_PLLI2SCFGR_PLLI2SM_SHIFT      (0)       /* Bits 0-5: Division factor M for audio PLL
                                                      *           (PLLI2S) input clock */
#define RCC_PLLI2SCFGR_PLLI2SM_MASK       (0x3f << RCC_PLLI2SCFGR_PLLI2SM_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SM(n)       ((n) << RCC_PLLI2SCFGR_PLLI2SM_SHIFT)
#define RCC_PLLI2SCFGR_PLLI2SN_SHIFT      (6)       /* Bits 6-14: PLLI2S N multiplication factor for VCO */
#define RCC_PLLI2SCFGR_PLLI2SN_MASK       (0x1ff << RCC_PLLI2SCFGR_PLLI2SN_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SN(n)       ((n) << RCC_PLLI2SCFGR_PLLI2SN_SHIFT)

#define RCC_PLLI2SCFGR_PLLI2SSRC_SHIFT	  (22)
#  define RCC_PLLI2SCFGR_PLLI2SSRC(n)     ((n) << RCC_PLLI2SCFGR_PLLI2SSRC_SHIFT) /* Bit 22: PLLI2S entry clock source */
#define RCC_PLLI2SCFGR_PLLI2SQ_SHIFT      (24)      /* Bits 24-27: PLLI2S division factor for USB OTG FS/SDIO/RNG clock */
#define RCC_PLLI2SCFGR_PLLI2SQ_MASK       (0xf << RCC_PLLI2SCFGR_PLLI2SQ_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SQ(n)       ((n) << RCC_PLLI2SCFGR_PLLI2SQ_SHIFT)
#define RCC_PLLI2SCFGR_PLLI2SR_SHIFT      (28)      /* Bits 28-30: PLLI2S division factor for I2S clocks */
#define RCC_PLLI2SCFGR_PLLI2SR_MASK       (7 << RCC_PLLI2SCFGR_PLLI2SR_SHIFT)
#  define RCC_PLLI2SCFGR_PLLI2SR(n)       ((n) << RCC_PLLI2SCFGR_PLLI2SR_SHIFT)

/* Dedicated clocks configuration register */

#define RCC_DCKCFGR_PLLI2SDIVQ_SHIFT    (0)       /* Bits 0-4: PLLI2S division 1..32 factor for I2S clock */
#define RCC_DCKCFGR_PLLI2SDIVQ_MASK     (0x1f << RCC_DCKCFGR_PLLI2SDIVQ_SHIFT)
#  define RCC_DCKCFGR_PLLI2SDIVQ(n)     (((n)-1) << RCC_DCKCFGR_PLLI2SDIVQ_SHIFT)
#define RCC_DCKCFGR_PLLSAIDIVQ_SHIFT    (8)       /* Bits 8-12: PLLSAI division 1..32 factor for SAI clock */
#define RCC_DCKCFGR_PLLSAIDIVQ_MASK     (0x1f << RCC_DCKCFGR_PLLSAIDIVQ_SHIFT)
#  define RCC_DCKCFGR_PLLSAIDIVQ(n)     (((n)-1) << RCC_DCKCFGR_PLLSAIDIVQ_SHIFT)
#define RCC_DCKCFGR_CKDFSDM1ASEL        (1 << 15) /* Bit 15: DFSDM1 audio clock selection. */
#define RCC_DCKCFGR_TIMPRE              (1 << 24) /* Bit 24: Timer clock prescaler selection */
#define RCC_DCKCFGR_I2S1SRC_SHIFT       (25)      /* Bits 25-26: I2S APB1 clock source selection */
#define RCC_DCKCFGR_I2S1SRC_MASK        (0x3 << RCC_DCKCFGR_I2S1SRC_SHIFT)
#  define RCC_DCKCFGR_I2S1SRC_PLLI2S    (0 << RCC_DCKCFGR_I2S1SRC_SHIFT)
#  define RCC_DCKCFGR_I2S1SRC_I2S_CKIN  (1 << RCC_DCKCFGR_I2S1SRC_SHIFT)
#  define RCC_DCKCFGR_I2S1SRC_PLL       (2 << RCC_DCKCFGR_I2S1SRC_SHIFT)
#  define RCC_DCKCFGR_I2S1SRC_HSX       (3 << RCC_DCKCFGR_I2S1SRC_SHIFT)
#define RCC_DCKCFGR_I2S2SRC_SHIFT       (27)      /* Bits 27-28: I2S APB2 clock source selection */
#define RCC_DCKCFGR_I2S2SRC_MASK        (0x3 << RCC_DCKCFGR_I2S2SRC_SHIFT)
#  define RCC_DCKCFGR_I2S2SRC_PLLI2S    (0 << RCC_DCKCFGR_I2S2SRC_SHIFT)
#  define RCC_DCKCFGR_I2S2SRC_I2S_CKIN  (1 << RCC_DCKCFGR_I2S2SRC_SHIFT)
#  define RCC_DCKCFGR_I2S2SRC_PLL       (2 << RCC_DCKCFGR_I2S2SRC_SHIFT)
#  define RCC_DCKCFGR_I2S2SRC_HSX       (3 << RCC_DCKCFGR_I2S2SRC_SHIFT)
#define RCC_DCKCFGR_CKDFSDMSEL          (1 << 31) /* Bit 31: DFSDM1 Kernel clock selection. */

/* RCC clocks gated enable register */

#  define RCC_CKGATENR_AHB2APB1_CKEN       (1 << 0)  /* Bit 0: AHB to APB1 Bridge clock enable */
#  define RCC_CKGATENR_AHB2APB2_CKEN       (1 << 1)  /* Bit 1: AHB to APB2 Bridge clock enable */
#  define RCC_CKGATENR_CM4DBG_CKEN         (1 << 2)  /* Bit 2: Cortex M4 ETM clock enable */
#  define RCC_CKGATENR_SPARE_CKEN          (1 << 3)  /* Bit 3: Spare clock enable */
#  define RCC_CKGATENR_SRAM_CKEN           (1 << 4)  /* Bit 4: SRAM controller clock enable */
#  define RCC_CKGATENR_FLITF_CKEN          (1 << 5)  /* Bit 5: Flash Interface clock enable */
#  define RCC_CKGATENR_RCC_CKEN            (1 << 6)  /* Bit 6: RCC clock enable */
#  define RCC_CKGATENR_EVTCL_CKEN          (1 << 7)  /* Bit 7: EVTCL clock enable */

/* Dedicated clocks configuration register 2 */

#define RCC_DCKCFGR2_FMPI2C1SEL_SHIFT    (22)      /* Bits 22-23: I2C4 clock source selection */
#define RCC_DCKCFGR2_FMPI2C1SEL_MASK     (3 << RCC_DCKCFGR2_FMPI2C1SEL_SHIFT)
#  define RCC_DCKCFGR2_FMPI2C1SEL_APB    (0 << RCC_DCKCFGR2_FMPI2C1SEL_SHIFT) /* APB1 clock (PCLK1) is selected as I2C 4 clock */
#  define RCC_DCKCFGR2_FMPI2C1SEL_SYSCLK (1 << RCC_DCKCFGR2_FMPI2C1SEL_SHIFT) /* System clock is selected as I2C 4 clock */
#  define RCC_DCKCFGR2_FMPI2C1SEL_HSI    (2 << RCC_DCKCFGR2_FMPI2C1SEL_SHIFT) /* HSI clock is selected as I2C 4 clock */
#define RCC_DCKCFGR2_CK48MSEL_SHIFT      (27)      /* Bit 27: 48 MHz clock source selection */
#define RCC_DCKCFGR2_CK48MSEL_MASK       (1 << RCC_DCKCFGR2_CK48MSEL_SHIFT)
#  define RCC_DCKCFGR2_CK48MSEL_PLL      (0 << RCC_DCKCFGR2_CK48MSEL_SHIFT) /* 48 MHz clock from PLL is selected */
#define RCC_DCKCFGR2_SDIOSEL_SHIFT       (28)      /* Bit 28: SDIO clock source selection */
#define RCC_DCKCFGR2_SDIOSEL_MASK        (1 << RCC_DCKCFGR2_SDIOSEL_SHIFT)
#  define RCC_DCKCFGR2_SDIOSEL_48MHZ     (0 << RCC_DCKCFGR2_SDIOSEL_SHIFT) /* 48 MHz clock is selected as SDMMC clock */
#  define RCC_DCKCFGR2_SDIOSEL_SYSCLK    (1 << RCC_DCKCFGR2_SDIOSEL_SHIFT) /* System clock is selected as SDMMC clock */

#endif /* __ARCH_ARM_SRC_STM32_HARDWARE_STM32F412XX_RCC_H */
